# Gruplama ve Toplulaştırma İşlemleri

## Gruplama ve Toplulaştırma (Grouping & Aggregation )

Basit toplulaştırma fonksiyonları:
* count()
* first()
* last()
* mean()
* median()
* min()
* max()
* std()
* var()
* sum()

In [4]:
import seaborn as sns

In [5]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [6]:
df.shape

(1035, 6)

In [7]:
df["mass"].mean()

2.6381605847953216

In [8]:
df["mass"].count()

513

In [9]:
df["mass"].min()

0.0036

In [10]:
df["mass"].max()

25.0

In [11]:
df["mass"].sum()

1353.37638

In [12]:
df["mass"].std()

3.8186166509616046

In [13]:
df["mass"].var()

14.58183312700122

In [14]:
df.describe() # Sayısal sütunlar için temel istatistiksel özetleri hesaplar ve döner.

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [15]:
df.describe().T # Pandas DataFrame üzerinde kullanıldığında, verinin temel istatistiksel özetini transpoze edilmiş şekilde (satır ve sütunların yer değiştirmesiyle) döner.

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

**T (Transpoz)**:
Tanım: T, bir DataFrame'in transpozunu alır. Yani satırlar sütun, sütunlar ise satır olur.
Kullanım Amacı: Verinin istatistiksel özetini satırlardan sütunlara çevirmek, özellikle veri analizlerinde görselleştirme veya raporlama yaparken daha kolay erişilebilir hale getirir.

In [16]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

## Gruplama İşlemleri

In [18]:
import pandas as pd

In [19]:
df2 = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                    "veri": [10,11,52,23,43,55]}, columns = ["gruplar", "veri"])
df2

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [20]:
df2.groupby("gruplar")

In [21]:
df2.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [22]:
df2.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [23]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [24]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [25]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

## İleri Toplulaştırma İşlemleri 
* Aggregate, Filter, Transform, Apply

### Aggregate

**aggregate() (veya agg())** :
* **Tanım**: aggregate() fonksiyonu, bir grup veriye birden fazla toplulaştırma fonksiyonu (örneğin mean, sum, min, max) uygulamak için kullanılır. Aynı sütuna veya farklı sütunlara birden fazla işlev uygulayabilirsiniz.
* **Kullanım Amacı**: Veriye toplulaştırıcı fonksiyonlar uygulayarak özet istatistikler elde etmek için kullanılır. Örneğin, her grubun ortalamasını, toplamını, minimum ve maksimum değerini alabilirsiniz.

In [28]:
import pandas as pd
import numpy as np

df3 = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                    "degisken1": [10,11,52,23,43,55],
                    "degisken2": [100,423,52,664,745,54]},
                    columns = ["gruplar", "degisken1","degisken2"])
df3

  gruplar  degisken1  degisken2
0       A         10        100
1       B         11        423
2       C         52         52
3       A         23        664
4       B         43        745
5       C         55         54

In [29]:
df3.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             16.5      382.0
B             27.0      584.0
C             53.5       53.0

In [30]:
df3.groupby("gruplar").aggregate(["min", np.median, "max"])
df3.groupby("gruplar").aggregate([min, np.median, max]) # min ve max, pandas içerisinde yer aldığı için tırnak içinde yazmasak da olur

C:\Users\tubac\AppData\Local\Temp\ipykernel_21060\4145807024.py:1: FutureWarning: The provided callable <function median at 0x000002246DAFAAC0> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  df3.groupby("gruplar").aggregate(["min", np.median, "max"])
C:\Users\tubac\AppData\Local\Temp\ipykernel_21060\4145807024.py:2: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df3.groupby("gruplar").aggregate([min, np.median, max]) # min ve max, pandas içerisinde yer aldığı için tırnak içinde yazmasak da olur
C:\Users\tubac\AppData\Local\Temp\ipykernel_21060\4145807024.py:2: FutureWarning: The provided callable <function median at 0x000002246DAFAAC0> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  df3.groupby("gruplar").aggregate([min, np.median, max]) # min ve max, pandas içerisinde yer aldığı için tırnak içinde yazmasak da olur
C:\Users\tubac\AppData\Local\Temp\ipykernel_21060\4145807024.py:2: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df3.groupby("gruplar").aggregate([min, np.median, max]) # min ve max, pandas içerisinde yer aldığı için tırnak içinde yazmasak da olur
C:\Users\tubac\AppData\Local\Temp\ipykernel_21060\4145807024.py:2: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df3.groupby("gruplar").aggregate([min, np.median, max]) # min ve max, pandas içerisinde yer aldığı için tırnak içinde yazmasak da olur

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.5  23       100  382.0  664
B              11   27.0  43       423  584.0  745
C              52   53.5  55        52   53.0   54

In [31]:
df3.groupby("gruplar").aggregate({"degisken1": "min", 
                                  "degisken2": "max"}) 
# değişken 1 ve 2 için farklı işlemler gerçekleştirdik

         degisken1  degisken2
gruplar
A               10        664
B               11        745
C               52         54

### Filter

**filter()**
* **Tanım**: filter(), gruplandırılmış verilere bir koşul uygulayarak sadece belirli kriterleri sağlayan grupları tutar, diğerlerini eler.
* **Kullanım Amacı**: Gruplar üzerinde belirli bir koşulu sağlayan alt kümeleri elde etmek için kullanılır. Örneğin, bir grubun toplamı belirli bir değerden büyükse sadece o grubu tutabilirsiniz.

In [33]:
df4 = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                    "degisken1": [10,11,52,23,43,55],
                    "degisken2": [100,423,52,664,745,54]},
                    columns = ["gruplar", "degisken1","degisken2"])
df4

  gruplar  degisken1  degisken2
0       A         10        100
1       B         11        423
2       C         52         52
3       A         23        664
4       B         43        745
5       C         55         54

In [34]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [42]:
df4.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         9.192388  398.808225
B        22.627417  227.688384
C         2.121320    1.414214

In [44]:
df4.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
0       A         10        100
1       B         11        423
3       A         23        664
4       B         43        745

### Transform

**transform()**
* **Tanım**: transform() fonksiyonu, her bir gruptaki verilere eleman bazında bir işlem uygulayarak, orijinal veri setiyle aynı boyutta bir çıktı üretir. Gruplara uygulanan işlemin sonuçları, orijinal DataFrame'deki yerini koruyarak döner.
* **Kullanım Amacı**: Her bir grup için hesaplanan değeri aynı gruptaki tüm elemanlara atamak için kullanılır. Örneğin, her elemanın grup ortalamasını veya toplamını elde etmek için kullanılabilir.

In [47]:
df5 = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                    "degisken1": [10,11,52,23,43,55],
                    "degisken2": [100,423,52,664,745,54]},
                    columns = ["gruplar", "degisken1","degisken2"])
df5

  gruplar  degisken1  degisken2
0       A         10        100
1       B         11        423
2       C         52         52
3       A         23        664
4       B         43        745
5       C         55         54

In [61]:
# df5[:, 1:2] -> HATA VERİR
df_a = df5.iloc[:, 1:3]

In [65]:
df_a.transform(lambda x: (x-x.mean()) / x.std())

   degisken1  degisken2
0  -1.101533  -0.759238
1  -1.052210   0.263991
2   0.970006  -0.911297
3  -0.460342   1.027453
4   0.526105   1.284052
5   1.117974  -0.904961

### Apply

*apply()*
* **Tanım**: apply(), her gruba veya tüm DataFrame’e özel fonksiyonlar uygulamak için kullanılır. apply(), daha karmaşık ve özelleştirilmiş işlemler yapmaya olanak tanır.
* **Kullanım Amacı**: Gruplara daha karmaşık işlemler veya özel fonksiyonlar uygulamak gerektiğinde kullanılır. Bu, toplulaştırma, dönüşüm veya filtreleme fonksiyonlarına kıyasla daha esnek bir yapıdır.

In [78]:
df6 = pd.DataFrame({"degisken1": [10,11,52,23,43,55],
                    "degisken2": [100,423,52,664,745,54]},
                    columns = ["degisken1","degisken2"])
df6

   degisken1  degisken2
0         10        100
1         11        423
2         52         52
3         23        664
4         43        745
5         55         54

In [80]:
df6.apply(np.sum)

degisken1     194
degisken2    2038
dtype: int64

In [82]:
df6.apply(np.mean)

degisken1     32.333333
degisken2    339.666667
dtype: float64

In [88]:
df7 = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                    "degisken1": [10,11,52,23,43,55],
                    "degisken2": [100,423,52,664,745,54]},
                    columns = ["gruplar", "degisken1","degisken2"])
df7

  gruplar  degisken1  degisken2
0       A         10        100
1       B         11        423
2       C         52         52
3       A         23        664
4       B         43        745
5       C         55         54

In [92]:
df7.groupby("gruplar").apply(np.sum)

C:\Users\tubac\anaconda3\Lib\site-packages\numpy\core\fromnumeric.py:86: FutureWarning: The behavior of DataFrame.sum with axis=None is deprecated, in a future version this will reduce over both axes and return a scalar. To retain the old behavior, pass axis=0 (or do not pass axis)
  return reduction(axis=axis, out=out, **passkwargs)
C:\Users\tubac\anaconda3\Lib\site-packages\numpy\core\fromnumeric.py:86: FutureWarning: The behavior of DataFrame.sum with axis=None is deprecated, in a future version this will reduce over both axes and return a scalar. To retain the old behavior, pass axis=0 (or do not pass axis)
  return reduction(axis=axis, out=out, **passkwargs)
C:\Users\tubac\anaconda3\Lib\site-packages\numpy\core\fromnumeric.py:86: FutureWarning: The behavior of DataFrame.sum with axis=None is deprecated, in a future version this will reduce over both axes and return a scalar. To retain the old behavior, pass axis=0 (or do not pass axis)
  return reduction(axis=axis, out=out, **passkwargs)
C:\Users\tubac\AppData\Local\Temp\ipykernel_21060\2453718010.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df7.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         33        764
B            BB         54       1168
C            CC        107        106

In [94]:
df7.groupby("gruplar").apply(np.mean)

gruplar
A    199.25
B    305.50
C     53.25
dtype: float64

## Pivot Tablolar

In [101]:
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [103]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [105]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [109]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

C:\Users\tubac\AppData\Local\Temp\ipykernel_21060\2203689429.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

### Pivot ile Table

In [114]:
titanic.pivot_table("survived", index = "sex", columns = "class")

C:\Users\tubac\AppData\Local\Temp\ipykernel_21060\1992281764.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  titanic.pivot_table("survived", index = "sex", columns = "class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [116]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [118]:
age = pd.cut(titanic["age"], [0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [120]:
titanic.pivot_table("survived", ["sex",age],"class")

C:\Users\tubac\AppData\Local\Temp\ipykernel_21060\33008487.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  titanic.pivot_table("survived", ["sex",age],"class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

## Dış Kaynaklı Veri Okumak

#### CSV okumak

In [129]:
pd.read_csv("reading_data/reading_data/ornekcsv.csv", sep = ";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

#### TXT okumak

In [139]:
pd.read_csv("reading_data/reading_data/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

### EXCEL okumak

In [144]:
pd.read_excel("reading_data/reading_data/ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [146]:
dataframe = pd.read_excel("reading_data/reading_data/ornekx.xlsx")

In [148]:
type(dataframe)

pandas.core.frame.DataFrame

In [150]:
dataframe.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [152]:
dataframe.columns = ("A", "B", "C")

In [154]:
dataframe

      A    B     C
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0